velitasali/circuitsimulator/resources/qemu-cosim/patch/hw/xtensa/esp32-cs.c
/*
 * ESP32 SoC and machine, forked as esp32-cs for Circuit Simulator co-simulation
 *
 * Copyright (c) 2019 Espressif Systems (Shanghai) Co. Ltd.
 * Copyright (c) 2026 Veli Tasali (esp32-cs fork)
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License version 2 or
 * (at your option) any later version.
 *
 * Forked from Espressif's public "esp32" machine (hw/xtensa/esp32.c,
 * github.com/espressif/qemu, branch esp-develop) to add Circuit Simulator's
 * shared-memory co-simulation device over the GPIO/IO_MUX/I2C0-1/HSPI/VSPI/
 * UART0-2/LEDC register windows. Everything else (DPORT, RTC_CNTL, TIMG,
 * EFUSE, RSA/SHA/AES, TWAI, RNG, SPI0/1 flash, RMT, PCNT, I2S, analog/rtcio)
 * stays exactly as Espressif wires it, so ROM boot, flash XIP and the
 * FreeRTOS tick keep working unmodified.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/error-report.h"
#include "qemu/units.h"
#include "qapi/error.h"
#include "hw/hw.h"
#include "hw/boards.h"
#include "hw/loader.h"
#include "hw/sysbus.h"
#include "hw/i2c/esp32_i2c.h"
#include "hw/xtensa/xtensa_memory.h"
#include "hw/misc/unimp.h"
#include "hw/irq.h"
#include "hw/i2c/i2c.h"
#include "hw/qdev-properties.h"
#include "hw/xtensa/esp32.h"
#include "hw/misc/ssi_psram.h"
#include "hw/sd/dwc_sdmmc.h"
#include "core-esp32/core-isa.h"
#include "qemu/datadir.h"
#include "qemu/timer.h"
#include "qemu/notify.h"
#include "sysemu/sysemu.h"
#include "sysemu/reset.h"
#include "sysemu/cpus.h"
#include "sysemu/runstate.h"
#include "sysemu/blockdev.h"
#include "sysemu/block-backend.h"
#include "exec/exec-all.h"
#include "net/net.h"
#include "elf.h"

#ifndef _WIN32
#include <sys/mman.h>
#include <fcntl.h>
#else
#include <windows.h>
#endif

/*
 * ---------------------------------------------------------------------------
 * Circuit Simulator co-simulation device.
 *
 * Mirrors qemuArena_t from src/microsim/cores/qemu/qemudevice.h
 * (CircuitSimulator repo) byte-for-byte -- this struct is the wire format for a
 * raw shared memory mapping between this process and Circuit Simulator's, so
 * its layout must never drift from that header without updating both sides
 * together.
 *
 * Protocol, as read off the consumer (qemudevice.cpp/qemumodule.cpp, both in
 * the CircuitSimulator repo -- there is no surviving QEMU-side implementation
 * to match, see the esp32-cs plan/memory for how this was derived):
 *   - regAddr is IOMEM-relative (absolute MMIO address minus DR_REG_DPORT_BASE,
 *     i.e. 0x3ff44000 -> 0x44000), not the raw guest physical address.
 *   - simuAction/regAddr/regData/simuTime is a single-slot mailbox: a new
 *     request may only be posted once the previous one's simuAction has been
 *     cleared back to SIM_NONE by the simulator.
 *   - simuAction carries the doorbell: the simulator spin-waits on simuAction
 *     becoming nonzero (QemuDevice::runEvent()), so it must be the LAST field
 *     written when posting a request -- simuTime/regAddr/regData must all be
 *     written before it, or the simulator can observe the doorbell and read
 *     stale/torn data.
 *   - only SIM_READ produces a response (qemuAction=SIM_READ once regData is
 *     valid); SIM_WRITE is fire-and-forget, matching real posted-write MMIO
 *     semantics -- the simulator applies it whenever its own event queue
 *     reaches that circuit time, with no further QEMU-side involvement.
 *   - irqNumber/irqLevel have no doorbell (deliberately unset by the
 *     simulator, see qemumodule.cpp's commented-out qemuAction=SIM_INTERRUPT)
 *     so QEMU must poll them, not wait for an edge.
 * ---------------------------------------------------------------------------
 */

typedef struct Esp32CsArena {
    uint64_t simuTime; /* ps, QEMU sets before simuAction, simulator clears to 0 */
    uint64_t qemuTime; /* ps, informational */
    uint64_t regData;
    uint64_t regAddr; /* IOMEM-relative, i.e. absolute - DR_REG_DPORT_BASE */
    uint64_t irqNumber; /* ESP32 intmatrix ETS_*_INTR_SOURCE id */
    uint64_t irqLevel;
    uint64_t simuAction; /* Esp32CsSimAction, set by QEMU */
    uint64_t qemuAction; /* Esp32CsSimAction, set by the simulator (SIM_READ only) */
    uint64_t running; /* QEMU sets 1 once attached and ready */
    int64_t loop_timeout_ns; /* unused by the current consumer */
    double ps_per_inst;
} Esp32CsArena;

enum {
    ESP32CS_SIM_NONE = 0,
    ESP32CS_SIM_READ,
    ESP32CS_SIM_WRITE,
    ESP32CS_SIM_FREQ,
    ESP32CS_SIM_INTERRUPT,
};

/* Matches the "-icount shift=4" this machine is always launched with
 * (Esp32::createArgs() in the CircuitSimulator repo) -- informational only, the
 * current consumer doesn't read ps_per_inst back, but keep it honest. */
#define ESP32CS_ICOUNT_SHIFT 4
#define ESP32CS_IRQ_POLL_NS 100000

typedef struct Esp32CsCosim {
    Esp32CsArena *arena;
#ifdef _WIN32
    HANDLE shm_handle;
#else
    int shm_fd;
#endif
    QEMUTimer *irq_poll_timer;
    DeviceState *intmatrix_dev;
    uint64_t last_irq_number;
    uint64_t last_irq_level;
} Esp32CsCosim;

/* One QEMU process only ever drives one Circuit Simulator device, so a
 * single file-scope instance avoids threading a pointer through the
 * machine-init -> soc-realize -> MemoryRegionOps call chain via QOM. */
static Esp32CsCosim esp32cs_cosim;

static int64_t esp32cs_now_ps(void)
{
    int64_t ps = qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) * (int64_t) 1000;
    /* simuTime==0 means "no event" on the consumer side, so a guest access
     * at virtual time 0 still has to post something nonzero. */
    return ps > 0 ? ps : 1;
}

static bool esp32cs_cosim_attach(const char *shm_key, Error **errp)
{
    if (!shm_key || !shm_key[0]) {
        error_setg(errp, "esp32-cs: the \"cosim-shm\" machine property is required "
                   "(Circuit Simulator's Esp32::createArgs() always passes it -- "
                   "if you're running this machine by hand, pass the same shared "
                   "memory key Circuit Simulator would)");
        return false;
    }
#ifdef _WIN32
    HANDLE hMap = OpenFileMappingA(FILE_MAP_ALL_ACCESS, FALSE, shm_key);
    if (!hMap) {
        error_setg(errp, "esp32-cs: OpenFileMapping(\"%s\") failed: %lu",
                   shm_key, (unsigned long) GetLastError());
        return false;
    }
    void *mem = MapViewOfFile(hMap, FILE_MAP_ALL_ACCESS, 0, 0, sizeof(Esp32CsArena));
    if (!mem) {
        error_setg(errp, "esp32-cs: MapViewOfFile(\"%s\") failed: %lu",
                   shm_key, (unsigned long) GetLastError());
        CloseHandle(hMap);
        return false;
    }
    esp32cs_cosim.arena = (Esp32CsArena *) mem;
    esp32cs_cosim.shm_handle = hMap;
#else
    int fd = shm_open(shm_key, O_RDWR, 0666);
    if (fd < 0) {
        error_setg(errp, "esp32-cs: shm_open(\"%s\") failed: %s", shm_key, strerror(errno));
        return false;
    }
    void *mem = mmap(NULL, sizeof(Esp32CsArena), PROT_READ | PROT_WRITE, MAP_SHARED, fd, 0);
    if (mem == MAP_FAILED) {
        error_setg(errp, "esp32-cs: mmap of \"%s\" failed: %s", shm_key, strerror(errno));
        close(fd);
        return false;
    }
    esp32cs_cosim.arena = (Esp32CsArena *) mem;
    esp32cs_cosim.shm_fd = fd;
#endif
    memset(esp32cs_cosim.arena, 0, sizeof(Esp32CsArena));
    esp32cs_cosim.arena->ps_per_inst = 1000.0 * (double) (1 << ESP32CS_ICOUNT_SHIFT);
    fprintf(stderr, "esp32-cs: cosim attached, shm=\"%s\" arena=%p size=%zu\n",
            shm_key, (void *) esp32cs_cosim.arena, sizeof(Esp32CsArena));
    return true;
}

#ifndef _WIN32
#include <sched.h>
#endif

