velitasali/circuitsimulator/resources/qemu-cosim/patch/hw/xtensa/esp32-cs.c
static inline void esp32cs_cpu_relax(void)
{
#if defined(__aarch64__) || defined(__arm__)
    __asm__ __volatile__("isb" : : : "memory");
#elif defined(__x86_64__) || defined(_M_X64) || defined(__i386__) || defined(_M_IX86)
    __asm__ __volatile__("pause" : : : "memory");
#else
    __asm__ __volatile__("" : : : "memory");
#endif
}

static inline void esp32cs_spin_wait_step(unsigned int *spin_count)
{
    if (*spin_count < 256) {
        esp32cs_cpu_relax();
        (*spin_count)++;
    } else {
#if defined(_WIN32)
        SwitchToThread();
#else
        sched_yield();
#endif
    }
}

/* Single-slot mailbox: don't clobber a request the simulator hasn't picked
 * up yet. Safe as a plain spin (no lock) because -icount forces QEMU's TCG
 * accelerator into single-threaded round-robin mode, so only one vCPU can
 * ever be inside this code at a time. */
static void esp32cs_wait_mailbox_free(Esp32CsArena *arena)
{
    unsigned int spins = 0;
    while (arena->simuAction != ESP32CS_SIM_NONE) {
        esp32cs_spin_wait_step(&spins);
    }
}

static int esp32cs_trace_budget = 0;

static uint64_t esp32cs_cosim_read(void *opaque, hwaddr addr, unsigned size)
{
    Esp32CsArena *arena = esp32cs_cosim.arena;
    hwaddr rel_base = (hwaddr)(uintptr_t) opaque;
    if (!arena) {
        return 0;
    }

    esp32cs_wait_mailbox_free(arena);

    arena->regAddr = rel_base + addr;
    arena->qemuTime = (uint64_t) esp32cs_now_ps();
    arena->simuTime = arena->qemuTime;
    arena->simuAction = ESP32CS_SIM_READ; /* doorbell -- must be written last, after simuTime */

    if (esp32cs_trace_budget > 0) {
        fprintf(stderr, "esp32-cs: READ  addr=0x%" PRIx64 " -- waiting for ack\n", (uint64_t) arena->regAddr);
    }
    unsigned int spins = 0;
    while (arena->qemuAction != ESP32CS_SIM_READ) {
        esp32cs_spin_wait_step(&spins);
    }
    uint32_t data = (uint32_t) arena->regData;
    arena->qemuAction = ESP32CS_SIM_NONE;
    if (esp32cs_trace_budget > 0) {
        fprintf(stderr, "esp32-cs: READ  addr=0x%" PRIx64 " data=0x%x\n", (uint64_t) arena->regAddr, data);
        esp32cs_trace_budget--;
    }
    return data;
}

static void esp32cs_cosim_write(void *opaque, hwaddr addr, uint64_t data, unsigned size)
{
    Esp32CsArena *arena = esp32cs_cosim.arena;
    hwaddr rel_base = (hwaddr)(uintptr_t) opaque;
    if (!arena) {
        return;
    }

    esp32cs_wait_mailbox_free(arena);

    arena->regAddr = rel_base + addr;
    arena->regData = data;
    arena->qemuTime = (uint64_t) esp32cs_now_ps();
    arena->simuTime = arena->qemuTime;
    arena->simuAction = ESP32CS_SIM_WRITE; /* doorbell -- must be written last, after simuTime; no response expected */
    if (esp32cs_trace_budget > 0) {
        fprintf(stderr, "esp32-cs: WRITE addr=0x%" PRIx64 " data=0x%" PRIx64 "\n", (uint64_t) arena->regAddr, data);
        esp32cs_trace_budget--;
    }
}

static const MemoryRegionOps esp32cs_cosim_ops = {
    .read = esp32cs_cosim_read,
    .write = esp32cs_cosim_write,
    .endianness = DEVICE_NATIVE_ENDIAN,
    .valid = { .min_access_size = 1, .max_access_size = 4 },
    .impl = { .min_access_size = 1, .max_access_size = 4 },
};

/* Mirrors esp32_soc_add_periph_device()'s dual DPORT-view/APB-view mapping so
 * firmware using either address convention reaches the same cosim window. */
static void esp32cs_add_cosim_window(MemoryRegion *dest, const char *name, hwaddr dport_base_addr, size_t size)
{
    hwaddr rel_base = dport_base_addr - DR_REG_DPORT_BASE;

    MemoryRegion *mr = g_new(MemoryRegion, 1);
    memory_region_init_io(mr, NULL, &esp32cs_cosim_ops, (void *) (uintptr_t) rel_base, name, size);
    memory_region_add_subregion_overlap(dest, dport_base_addr, mr, 0);

    MemoryRegion *mr_apb = g_new(MemoryRegion, 1);
    char *name_apb = g_strdup_printf("%s-apb", name);
    memory_region_init_io(mr_apb, NULL, &esp32cs_cosim_ops, (void *) (uintptr_t) rel_base, name_apb, size);
    memory_region_add_subregion_overlap(dest, dport_base_addr - DR_REG_DPORT_APB_BASE + APB_REG_BASE, mr_apb, 0);
    g_free(name_apb);
}

static void esp32cs_irq_poll_timer_cb(void *opaque)
{
    Esp32CsCosim *cs = &esp32cs_cosim;
    if (cs->arena && cs->intmatrix_dev) {
        uint64_t number = cs->arena->irqNumber;
        uint64_t level = cs->arena->irqLevel;
        if ((number != cs->last_irq_number || level != cs->last_irq_level)
            && number < ESP32_INT_MATRIX_INPUTS) {
            qemu_set_irq(qdev_get_gpio_in(cs->intmatrix_dev, (int) number), (int) level);
            cs->last_irq_number = number;
            cs->last_irq_level = level;
        }
    }
    timer_mod(cs->irq_poll_timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + ESP32CS_IRQ_POLL_NS);
}

static void esp32cs_start_irq_poll(DeviceState *intmatrix_dev)
{
    esp32cs_cosim.intmatrix_dev = intmatrix_dev;
    esp32cs_cosim.irq_poll_timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, esp32cs_irq_poll_timer_cb, NULL);
    timer_mod(esp32cs_cosim.irq_poll_timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + ESP32CS_IRQ_POLL_NS);
}

static void esp32cs_machine_init_done(Notifier *notifier, void *data)
{
    fprintf(stderr, "esp32-cs: machine_init_done, arena=%p\n", (void *) esp32cs_cosim.arena);
    if (esp32cs_cosim.arena) {
        esp32cs_cosim.arena->running = 1;
        fprintf(stderr, "esp32-cs: arena->running=1\n");
    }
}

static Notifier esp32cs_machine_init_done_notifier = {
    .notify = esp32cs_machine_init_done,
};

#define TYPE_ESP32_SOC "xtensa.esp32cs"
#define ESP32_SOC(obj) OBJECT_CHECK(Esp32SocState, (obj), TYPE_ESP32_SOC)

#define TYPE_ESP32_CPU XTENSA_CPU_TYPE_NAME("esp32")



enum {
    ESP32_MEMREGION_IROM,
    ESP32_MEMREGION_DROM,
    ESP32_MEMREGION_DRAM,
    ESP32_MEMREGION_IRAM,
    ESP32_MEMREGION_ICACHE0,
    ESP32_MEMREGION_ICACHE1,
    ESP32_MEMREGION_RTCSLOW,
    ESP32_MEMREGION_RTCFAST_D,
    ESP32_MEMREGION_RTCFAST_I,
    ESP32_MEMREGION_FRAMEBUF,
};

static const struct MemmapEntry {
    hwaddr base;
    hwaddr size;
} esp32_memmap[] = {
    [ESP32_MEMREGION_DROM] = { 0x3ff90000, 0x10000 },
    [ESP32_MEMREGION_IROM] = { 0x40000000, 0x70000 },
    [ESP32_MEMREGION_DRAM] = { 0x3ffae000, 0x52000 },
    [ESP32_MEMREGION_IRAM] = { 0x40080000, 0x40000 },
    [ESP32_MEMREGION_ICACHE0] = { 0x40070000, 0x8000 },
    [ESP32_MEMREGION_ICACHE1] = { 0x40078000, 0x8000 },
    [ESP32_MEMREGION_RTCSLOW] = { 0x50000000, 0x2000 },
    [ESP32_MEMREGION_RTCFAST_I] = { 0x400C0000, 0x2000 },
    [ESP32_MEMREGION_RTCFAST_D] = { 0x3ff80000, 0x2000 },
    /* Virtual Framebuffer, used for the graphical interface */
    [ESP32_MEMREGION_FRAMEBUF] = { 0x20000000, ESP_RGB_MAX_VRAM_SIZE }
};


